export const symptomConfig={
    // 手臂症状
  Wolf3D_Body: 
  {
    diseasePart: "手臂",
    availableOptions: {
      "右前臂": ["右前臂疼 ", "右前臂擦伤 ", "右前臂撕裂伤 ", "右前臂刀伤 ", "右前臂烧伤 "],
      "右后臂": ["右后臂疼 ", "右后臂擦伤 ", "右后臂撕裂伤 ", "右后臂刀伤 ", "右后臂烧伤 "],
      '右手掌': [
            '右手掌麻木 ',
            '右手掌疼痛 ',
            '右手手指关节疼痛 ',
            '右手腕疼痛 ',
            '右手掌肌肉无力 ',
          ],
          '左前臂': [
            '左前臂疼 ',
            '左前臂擦伤 ',
            '左前臂撕裂伤 ',
            '左前臂刀伤 ',
            '左前臂烧伤 ',
          ],
          '左后臂': [
            '左后臂疼 ',
            '左后臂擦伤 ',
            '左后臂撕裂伤 ',
            '左后臂刀伤 ',
            '左后臂烧伤 ',
          ],
          '左手掌': [
            '左手掌麻木 ',
            '左手掌疼痛 ',
            '左手手指关节疼痛 ',
            '左手腕疼痛 ',
            '左手掌肌肉无力 ',
          ],
        }
    },
    // 头部症状
  Wolf3D_Hair: 
  {
    diseasePart: "头部",
    availableOptions: {
      "头部": [
        '头痛 ',
        '头晕 ',
        '偏头痛 ',
        '脑震荡 ',
        '中风 ',
        '头部疲劳 ',
        '思考能力减退 ',
        '记忆混乱 ',
        '充血 ',
        '紧张 ',
        '意识改变 ',
        '失眠 ',
        '抑郁 ',
        '焦虑 ',
        ],
    }
  },
  Wolf3D_Outfit_Bottom:
  {
    diseasePart:"腿部",
    availableOptions:{
        '右小腿 ': [
        '右小腿疼 ',
        '右小腿擦伤 ',
        '右小腿撕裂伤 ',
        '右小腿刀伤 ',
        '右小腿烧伤 ',
      ],
      '右大腿': [
        '右大腿疼 ',
        '右大腿擦伤 ',
        '右大腿撕裂伤 ',
        '右大腿刀伤 ',
        '右大腿烧伤 ',
      ],
      '左小腿': [
        '左小腿疼 ',
        '左小腿擦伤 ',
        '左小腿撕裂伤 ',
        '左小腿刀伤 ',
        '左小腿烧伤 ',
      ],
      '左大腿': [
        '左大腿疼 ',
        '左大腿擦伤 ',
        '左大腿撕裂伤 ',
        '左大腿刀伤 ',
        '左大腿烧伤 ',
      ],
    }
  },
  Wolf3D_Outfit_Footwear:
  {
    diseasePart:"足部",
    availableOptions:{
        '右脚掌': [
        '右脚掌疼 ',
        '右脚掌擦伤 ',
        '右脚掌撕裂伤 ',
        '右脚掌刀伤 ',
      ],
      '右脚腕': [
        '右脚腕疼 ',
        '右脚腕骨折 ',
        '右脚腕扭伤 ',
        '右脚腕肿胀 ',
        '右脚腕韧带撕裂 ',
      ],
      '左脚掌': [
        '左脚掌疼 ',
        '左脚掌擦伤 ',
        '左脚掌撕裂伤 ',
        '左脚掌刀伤 ',
      ],
      '左脚腕': [
        '左脚腕疼 ',
        '左脚腕骨折 ',
        '左脚腕扭伤 ',
        '左脚腕肿胀 ',
        '左脚腕韧带撕裂 ',
      ],
    }
  },
  Wolf3D_Head:
  {
    diseasePart:"耳鼻喉口腔",
    availableOptions:{
        '耳朵': [
        '耳朵疼 ',
        '耳朵肿 ',
        '耳鸣 ',
        '耳朵痒 ',
      ],
      '鼻子': [
        '鼻子疼 ',
        '鼻子痒 ',
        '鼻塞 ',
        '流鼻涕 ',
      ],
      '咽喉': [
        '咽炎 ',
        '扁桃体发炎 ',
        '咽部脓肿 ',
        '喉外伤(闭合性喉外伤、开放性喉外伤、喉烫伤及烧灼伤、喉插管损伤) ',
        '炎症性疾病(急性会厌炎、急性喉炎、慢性喉炎、声带小结、声带息肉、喉关节炎) '
      ],
      '口腔': [
        '牙疼 ',
        '牙龈出血 ',
        '龋齿 ',
        '口臭 ',
        '牙床肿痛 ',
        '智齿 ',
        '牙黄 ',
        '口腔「上火」 ',
        '口腔溃疡 ',
        '舌头上长包 ',
        '面颈部长包块 ',
        '口干 ',
        '口水多 ',
        ],
    }
  },
  Wolf3D_Outfit_Top:
  {
      diseasePart:"躯干",
      availableOptions:{
          '血管类': [
          '动脉粥样硬化 ',
          '高血压 ',
          '静脉曲张 ',
          '深静脉血栓 ',
          '动脉瘤 ',
          '外周动脉疾病(PAD) ',
          '静脉炎 ',
        ],
        '心脏类': [
          '冠心病 ',
          '心力衰竭 ',
          '心肌梗死 ',
          '心律失常 ',
          '心脏瓣膜病（二尖瓣狭窄、主动脉瓣狭窄等） ',
          '先天性心脏病 ',
          '心包炎 ',
        ],
        '肺部': [
          '慢性阻塞性肺疾病(COPD) ',
          '肺炎 ',
          '哮喘 ',
          '肺结核 ',
          '肺纤维化 ',
          '支气管炎 ',
          '气胸 '
        ],
        '肾脏': [
          '慢性肾病(CKD) ',
          '急性肾损伤(AKI) ', 
          '肾结石 ',
          '肾炎 ',
          '肾囊肿 ',
        ],
        '肝脏':[
          '脂肪肝 ',
          '肝炎 ',
          '肝硬化 ',
          '自身免疫性肝炎 ',
          '肝衰竭 ',
          '血色病 ',
        ],
      }
  },
  EyeLeft:{
    diseasePart:"眼睛",
    availableOptions:{
        '眼睛':[
        '青光眼 ',
        '白内障 ',
        '干眼症 ',
        '结膜炎 ',
        '近视 ',
        '远视 ',
        '弱视 ',
        '老花眼 ',
        '散光 ',
        '视网膜裂孔及脱离 ',
        '糖尿病性视网膜病变 ',
        '屈光不正 ',
        '飞蚊症 ',
        '麦粒肿 ',
        ],
    }
  },
  EyeRight:{
    diseasePart:"眼睛",
    availableOptions:{
        '眼睛':[
        '青光眼 ',
        '白内障 ',
        '干眼症 ',
        '结膜炎 ',
        '近视 ',
        '远视 ',
        '弱视 ',
        '老花眼 ',
        '散光 ',
        '视网膜裂孔及脱离 ',
        '糖尿病性视网膜病变 ',
        '屈光不正 ',
        '飞蚊症 ',
        '麦粒肿 ',
        ],
    }
  }

}